app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "'hihi'"], ["email", nil], ["created_at", "2023-11-22 21:46:56.021313"], ["updated_at", "2023-11-22 21:46:56.021313"]]
---
    def create
        user = User.new(params.require(:user).permit(:name, :email))

        # user.save!
        # render json: user
        if user.save